

<!DOCTYPE html>
<html lang="null">
<head prefix="og: http://ogp.me/ns#">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="null">
    <title>Jobs-必须找到你所钟爱的东西 | Joe&#39;s Doc</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x53F2;&amp;#x8482;&amp;#x592B;&amp;#x4E54;&amp;#x5E03;&amp;#x65AF;6&amp;#x6708;&amp;#x65AF;&amp;#x5766;&amp;#x4F5B;&amp;#x5927;&amp;#x5B66;&amp;#x6F14;&amp;#x8BB2;: &amp;#x5FC5;&amp;#x987B;&amp;#x627E;&amp;#x5230;&amp;#x4F60;&amp;#x6240;&amp;#x949F;&amp;#x7231;&amp;#x7684;&amp;#x4E1C;&amp;#x89">
<meta property="og:type" content="article">
<meta property="og:title" content="Jobs-必须找到你所钟爱的东西">
<meta property="og:url" content="http://yoursite.com/2011/10/03/001.Jobs-必须找到你所钟爱的东西/index.html">
<meta property="og:site_name" content="Joe's Doc">
<meta property="og:description" content="&amp;#x53F2;&amp;#x8482;&amp;#x592B;&amp;#x4E54;&amp;#x5E03;&amp;#x65AF;6&amp;#x6708;&amp;#x65AF;&amp;#x5766;&amp;#x4F5B;&amp;#x5927;&amp;#x5B66;&amp;#x6F14;&amp;#x8BB2;: &amp;#x5FC5;&amp;#x987B;&amp;#x627E;&amp;#x5230;&amp;#x4F60;&amp;#x6240;&amp;#x949F;&amp;#x7231;&amp;#x7684;&amp;#x4E1C;&amp;#x89">
<meta property="og:updated_time" content="2017-02-28T16:24:05.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Jobs-必须找到你所钟爱的东西">
<meta name="twitter:description" content="&amp;#x53F2;&amp;#x8482;&amp;#x592B;&amp;#x4E54;&amp;#x5E03;&amp;#x65AF;6&amp;#x6708;&amp;#x65AF;&amp;#x5766;&amp;#x4F5B;&amp;#x5927;&amp;#x5B66;&amp;#x6F14;&amp;#x8BB2;: &amp;#x5FC5;&amp;#x987B;&amp;#x627E;&amp;#x5230;&amp;#x4F60;&amp;#x6240;&amp;#x949F;&amp;#x7231;&amp;#x7684;&amp;#x4E1C;&amp;#x89">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:undefined",
  "image": "undefined",
  "name": "Joe Lee",
  "url": "http://yoursite.com"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.gmirror.org/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>Joe&#39;s Doc</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/me.jpg">
                </div>
                <div class="content">
                    <a class="header">Joe Lee</a>
                    
                        <div class="meta">
                            Developer/iOS/Basketball
                        </div>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        <div class="item">
                            <i class="marker icon" style="float: left"></i>
                            <div class="content">Beijing</div>
                        </div>
                        
                        
                        <div class="item">
                            <i class="mail icon" style="float: left"></i>
                            <div class="content">
                                <a href="mailto:zhuocheng.lee@gmail.com">zhuocheng.lee@gmail.com</a>
                            </div>
                        </div>
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        

                                <a href="https://github.com/joeleee"><i class="large github icon" style="float: left"></i></a>

                            

                                <a href="http://weibo.com/209093838?is_all=1"><i class="large weibo icon" style="float: left"></i></a>

                            
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item" >
        <i class="home icon"></i>
        Home
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-001.Jobs-必须找到你所钟爱的东西" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    Jobs-必须找到你所钟爱的东西
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>&#x53F2;&#x8482;&#x592B;&#x4E54;&#x5E03;&#x65AF;6&#x6708;&#x65AF;&#x5766;&#x4F5B;&#x5927;&#x5B66;&#x6F14;&#x8BB2;: &#x5FC5;&#x987B;&#x627E;&#x5230;&#x4F60;&#x6240;&#x949F;&#x7231;&#x7684;&#x4E1C;&#x897F;</p>
<p>&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x5C06;&#x751F;&#x547D;&#x4E2D;&#x7684;&#x70B9;&#x70B9;&#x6EF4;&#x6EF4;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x5173;&#x4E8E;&#x7231;&#x548C;&#x635F;&#x5931;&#xFF0C;&#x5173;&#x4E8E;&#x6B7B;&#x4EA1;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x4E54;&#x5E03;&#x65AF;&#x5728;2005&#x5E74;6&#x6708;12&#x65E5;&#x5728;&#x65AF;&#x5766;&#x4F5B;&#x5927;&#x5B66;&#x6240;&#x505A;&#x7684;&#x6F14;&#x8BB2;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6211;&#x4ECA;&#x5929;&#x5F88;&#x8363;&#x5E78;&#x80FD;&#x548C;&#x4F60;&#x4EEC;&#x4E00;&#x8D77;&#x53C2;&#x52A0;&#x6BD5;&#x4E1A;&#x5178;&#x793C;&#xFF0C;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x597D;&#x7684;&#x5927;&#x5B66;&#x4E4B;&#x4E00;&#x3002;&#x6211;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4ECE;&#x5927;&#x5B66;&#x4E2D;&#x6BD5;&#x4E1A;&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4ECA;&#x5929;&#x4E5F;&#x8BB8;&#x662F;&#x5728;&#x6211;&#x7684;&#x751F;&#x547D;&#x4E2D;&#x79BB;&#x5927;&#x5B66;&#x6BD5;&#x4E1A;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x5929;&#x4E86;&#x3002;&#x4ECA;&#x5929;&#x6211;&#x60F3;&#x5411;&#x4F60;&#x4EEC;&#x8BB2;&#x8FF0;&#x6211;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x4E09;&#x4E2A;&#x6545;&#x4E8B;&#x3002;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x5927;&#x4E0D;&#x4E86;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x662F;&#x4E09;&#x4E2A;&#x6545;&#x4E8B;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x3000;&#x3000;&#x7B2C;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#x662F;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x628A;&#x751F;&#x547D;&#x4E2D;&#x7684;&#x70B9;&#x70B9;&#x6EF4;&#x6EF4;&#x4E32;&#x8FDE;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6211;&#x5728;&#x91CC;&#x5FB7;&#x5B66;&#x9662;&#x8BFB;&#x4E86;&#x516D;&#x4E2A;&#x6708;&#x4E4B;&#x540E;&#x5C31;&#x9000;&#x5B66;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5341;&#x516B;&#x4E2A;&#x6708;&#x4EE5;&#x540E;&#x2014;&#x2014;&#x6211;&#x771F;&#x6B63;&#x7684;&#x4F5C;&#x51FA;&#x9000;&#x5B66;&#x51B3;&#x5B9A;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x8FD8;&#x7ECF;&#x5E38;&#x53BB;&#x5B66;&#x6821;&#x3002;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x9000;&#x5B66;&#x5462;&#xFF1F;</p>
<p>&#x3000;&#x3000;&#x6545;&#x4E8B;&#x4ECE;&#x6211;&#x51FA;&#x751F;&#x7684;&#x65F6;&#x5019;&#x8BB2;&#x8D77;&#x3002;&#x6211;&#x7684;&#x4EB2;&#x751F;&#x6BCD;&#x4EB2;&#x662F;&#x4E00;&#x4E2A;&#x5E74;&#x8F7B;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x7ED3;&#x5A5A;&#x7684;&#x5927;&#x5B66;&#x6BD5;&#x4E1A;&#x751F;&#x3002;&#x5979;&#x51B3;&#x5B9A;&#x8BA9;&#x522B;&#x4EBA;&#x6536;&#x517B;&#x6211;&#xFF0C;&#x5979;&#x5341;&#x5206;&#x60F3;&#x8BA9;&#x6211;&#x88AB;&#x5927;&#x5B66;&#x6BD5;&#x4E1A;&#x751F;&#x6536;&#x517B;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EB2;&#x751F;&#x6BCD;&#x4EB2;&#x968F;&#x540E;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x7684;&#x517B;&#x6BCD;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4E0A;&#x8FC7;&#x5927;&#x5B66;&#xFF0C;&#x6211;&#x7684;&#x517B;&#x7236;&#x751A;&#x81F3;&#x4ECE;&#x6CA1;&#x6709;&#x8BFB;&#x8FC7;&#x9AD8;&#x4E2D;&#x3002;&#x5979;&#x62D2;&#x7EDD;&#x7B7E;&#x8FD9;&#x4E2A;&#x6536;&#x517B;&#x5408;&#x540C;&#x3002;&#x53EA;&#x662F;&#x5728;&#x51E0;&#x4E2A;&#x6708;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x7684;&#x517B;&#x7236;&#x6BCD;&#x7B54;&#x5E94;&#x5979;&#x4E00;&#x5B9A;&#x8981;&#x8BA9;&#x6211;&#x4E0A;&#x5927;&#x5B66;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x5979;&#x624D;&#x540C;&#x610F;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5728;&#x5341;&#x4E03;&#x5C81;&#x90A3;&#x5E74;&#xFF0C;&#x6211;&#x611A;&#x8822;&#x7684;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x6240;&#x51E0;&#x4E4E;&#x548C;&#x4F60;&#x4EEC;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x4E00;&#x6837;&#x8D35;&#x7684;&#x5B66;&#x6821;&#x3002;&#x6211;&#x7236;&#x6BCD;&#x8FD8;&#x5904;&#x4E8E;&#x84DD;&#x9886;&#x9636;&#x5C42;&#xFF0C;&#x4ED6;&#x4EEC;&#x51E0;&#x4E4E;&#x628A;&#x6240;&#x6709;&#x79EF;&#x84C4;&#x90FD;&#x82B1;&#x5728;&#x4E86;&#x6211;&#x7684;&#x5B66;&#x8D39;&#x4E0A;&#x9762;&#x3002;&#x5728;&#x516D;&#x4E2A;&#x6708;&#x540E;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x770B;&#x4E0D;&#x5230;&#x5176;&#x4E2D;&#x7684;&#x4EF7;&#x503C;&#x6240;&#x5728;&#x3002;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x51E0;&#x4E4E;&#x82B1;&#x5149;&#x4E86;&#x6211;&#x7236;&#x6BCD;&#x8FD9;&#x4E00;&#x8F88;&#x5B50;&#x7684;&#x6240;&#x6709;&#x79EF;&#x84C4;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x51B3;&#x5B9A;&#x8981;&#x9000;&#x5B66;&#x3002;&#x4E0D;&#x80FD;&#x5426;&#x8BA4;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x7684;&#x5BB3;&#x6015;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x56DE;&#x5934;&#x770B;&#x770B;&#xFF0C;&#x90A3;&#x7684;&#x786E;&#x662F;&#x6211;&#x8FD9;&#x4E00;&#x751F;&#x4E2D;&#x6700;&#x68D2;&#x7684;&#x4E00;&#x4E2A;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x3000;&#x3000;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x7F57;&#x66FC;&#x8482;&#x514B;&#x3002;&#x6211;&#x5931;&#x53BB;&#x4E86;&#x6211;&#x7684;&#x5BBF;&#x820D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x53EA;&#x80FD;&#x5728;&#x670B;&#x53CB;&#x623F;&#x95F4;&#x7684;&#x5730;&#x677F;&#x4E0A;&#x9762;&#x7761;&#x89C9;&#xFF0C;&#x6211;&#x53BB;&#x6361;5&#x7F8E;&#x5206;&#x7684;&#x53EF;&#x4E50;&#x74F6;&#x5B50;&#xFF0C;&#x4EC5;&#x4EC5;&#x4E3A;&#x4E86;&#x586B;&#x9971;&#x809A;&#x5B50;&#xFF0C;&#x5728;&#x661F;&#x671F;&#x5929;&#x7684;&#x665A;&#x4E0A;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x8D70;&#x4E03;&#x82F1;&#x91CC;&#x7684;&#x8DEF;&#x7A0B;&#xFF0C;&#x7A7F;&#x8FC7;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#xFF0C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x80FD;&#x5403;&#x4E0A;&#x996D;&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x661F;&#x671F;&#x552F;&#x4E00;&#x4E00;&#x987F;&#x597D;&#x4E00;&#x70B9;&#x7684;&#x996D;&#x3002;&#x4F46;&#x662F;&#x6211;&#x559C;&#x6B22;&#x8FD9;&#x6837;&#x3002;&#x6211;&#x8DDF;&#x7740;&#x6211;&#x7684;&#x76F4;&#x89C9;&#x548C;&#x597D;&#x5947;&#x5FC3;&#x8D70;&#xFF0C;&#x9047;&#x5230;&#x7684;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x6B64;&#x540E;&#x88AB;&#x8BC1;&#x660E;&#x662F;&#x65E0;&#x4EF7;&#x4E4B;&#x5B9D;&#x3002;&#x8BA9;&#x6211;&#x7ED9;&#x4F60;&#x4EEC;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x5427;&#xFF1A;</p>
<p>&#x3000;&#x3000;&#x91CC;&#x5FB7;&#x5B66;&#x9662;&#x5728;&#x90A3;&#x65F6;&#x63D0;&#x4F9B;&#x4E5F;&#x8BB8;&#x662F;&#x5168;&#x7F8E;&#x6700;&#x597D;&#x7684;&#x7F8E;&#x672F;&#x5B57;&#x8BFE;&#x7A0B;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x5927;&#x5B66;&#x91CC;&#x9762;&#x7684;&#x6BCF;&#x4E2A;&#x6D77;&#x62A5;&#xFF0C;&#x6BCF;&#x4E2A;&#x62BD;&#x5C49;&#x7684;&#x6807;&#x7B7E;&#x4E0A;&#x9762;&#x5168;&#x90FD;&#x662F;&#x6F02;&#x4EAE;&#x7684;&#x7F8E;&#x672F;&#x5B57;&#x3002;&#x6211;&#x51B3;&#x5B9A;&#x53BB;&#x5B66;&#x5B66;&#x600E;&#x6837;&#x5199;&#x51FA;&#x6F02;&#x4EAE;&#x7684;&#x7F8E;&#x672F;&#x5B57;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5F53;&#x65F6;&#x770B;&#x8D77;&#x6765;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5728;&#x6211;&#x7684;&#x751F;&#x547D;&#x4E2D;&#xFF0C;&#x597D;&#x50CF;&#x90FD;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x7684;&#x53EF;&#x80FD;&#x3002;&#x4F46;&#x662F;&#x5341;&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x8BBE;&#x8BA1;&#x7B2C;&#x4E00;&#x53F0;Macintosh&#x7535;&#x8111;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4E0D;&#x662F;&#x90A3;&#x6837;&#x4E86;&#x3002;&#x6211;&#x628A;&#x5F53;&#x65F6;&#x6211;&#x5B66;&#x7684;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x5168;&#x90FD;&#x8BBE;&#x8BA1;&#x8FDB;&#x4E86;Mac&#x3002;&#x90A3;&#x662F;&#x7B2C;&#x4E00;&#x53F0;&#x4F7F;&#x7528;&#x4E86;&#x6F02;&#x4EAE;&#x7684;&#x5370;&#x5237;&#x5B57;&#x4F53;&#x7684;&#x7535;&#x8111;&#x3002;&#x5982;&#x679C;&#x6211;&#x5F53;&#x65F6;&#x6CA1;&#x6709;&#x9000;&#x5B66;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x673A;&#x4F1A;&#x53BB;&#x53C2;&#x52A0;&#x8FD9;&#x4E2A;&#x6211;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x7F8E;&#x672F;&#x5B57;&#x8BFE;&#x7A0B;&#xFF0C;Mac&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x4E30;&#x5BCC;&#x7684;&#x5B57;&#x4F53;&#xFF0C;&#x4EE5;&#x53CA;&#x8D4F;&#x5FC3;&#x60A6;&#x76EE;&#x7684;&#x5B57;&#x4F53;&#x95F4;&#x8DDD;&#x3002;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x4E2A;&#x4EBA;&#x7535;&#x8111;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x73B0;&#x5728;&#x8FD9;&#x4E48;&#x7F8E;&#x5999;&#x7684;&#x5B57;&#x578B;&#x4E86;&#x3002;&#x5F53;&#x7136;&#x6211;&#x5728;&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x4E0D;&#x53EF;&#x80FD;&#x628A;&#x4ECE;&#x524D;&#x7684;&#x70B9;&#x70B9;&#x6EF4;&#x6EF4;&#x4E32;&#x8FDE;&#x8D77;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x5341;&#x5E74;&#x540E;&#x56DE;&#x987E;&#x8FD9;&#x4E00;&#x5207;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x771F;&#x7684;&#x8C41;&#x7136;&#x5F00;&#x6717;&#x4E86;&#x3002;</p>
<p>&#x3000;&#x3000;&#x4F60;&#x5728;&#x5411;&#x524D;&#x5C55;&#x671B;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x53EF;&#x80FD;&#x5C06;&#x8FD9;&#x4E9B;&#x7247;&#x65AD;&#x4E32;&#x8FDE;&#x8D77;&#x6765;&#xFF1B;&#x4F60;&#x53EA;&#x80FD;&#x5728;&#x56DE;&#x987E;&#x7684;&#x65F6;&#x5019;&#x5C06;&#x70B9;&#x70B9;&#x6EF4;&#x6EF4;&#x4E32;&#x8FDE;&#x8D77;&#x6765;&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x5FC5;&#x987B;&#x76F8;&#x4FE1;&#x8FD9;&#x4E9B;&#x7247;&#x65AD;&#x4F1A;&#x5728;&#x4F60;&#x672A;&#x6765;&#x7684;&#x67D0;&#x4E00;&#x5929;&#x4E32;&#x8FDE;&#x8D77;&#x6765;&#x3002;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x76F8;&#x4FE1;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#xFF1A;&#x4F60;&#x7684;&#x52C7;&#x6C14;&#x3001;&#x76EE;&#x7684;&#x3001;&#x751F;&#x547D;&#x3001;&#x56E0;&#x7F18;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4EE4;&#x6211;&#x5931;&#x671B;&#xFF0C;&#x53EA;&#x662F;&#x8BA9;&#x6211;&#x7684;&#x751F;&#x547D;&#x66F4;&#x52A0;&#x5730;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6211;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x6545;&#x4E8B;&#x662F;&#x5173;&#x4E8E;&#x7231;&#x548C;&#x635F;&#x5931;&#x7684;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6211;&#x975E;&#x5E38;&#x5E78;&#x8FD0;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5728;&#x5F88;&#x65E9;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x627E;&#x5230;&#x4E86;&#x6211;&#x949F;&#x7231;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x65AF;&#x8482;&#x592B;&#x2022;&#x6C83;&#x5179;&#x5C3C;&#x4E9A;&#x514B;&#x548C;&#x6211;&#x5728;&#x4E8C;&#x5341;&#x5C81;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5728;&#x7236;&#x6BCD;&#x7684;&#x8F66;&#x5E93;&#x91CC;&#x9762;&#x5F00;&#x521B;&#x4E86;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x3002;&#x5341;&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x4ECE;&#x90A3;&#x4E24;&#x4E2A;&#x8F66;&#x5E93;&#x4E2D;&#x7684;&#x7A77;&#x5149;&#x86CB;&#x53D1;&#x5C55;&#x5230;&#x4E86;&#x8D85;&#x8FC7;&#x56DB;&#x5343;&#x540D;&#x7684;&#x96C7;&#x5458;&#x3001;&#x4EF7;&#x503C;&#x8D85;&#x8FC7;&#x4E8C;&#x5341;&#x4EBF;&#x7684;&#x5927;&#x516C;&#x53F8;&#x3002;&#x5728;&#x516C;&#x53F8;&#x6210;&#x7ACB;&#x7684;&#x7B2C;&#x4E5D;&#x5E74;&#xFF0C;&#x6211;&#x4EEC;&#x521A;&#x521A;&#x53D1;&#x5E03;&#x4E86;&#x6700;&#x597D;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x90A3;&#x5C31;&#x662F;Macintosh&#x3002;&#x3000;&#x3000;</p>
<p>&#x3000;&#x3000;&#x6211;&#x4E5F;&#x5FEB;&#x8981;&#x5230;&#x4E09;&#x5341;&#x5C81;&#x4E86;&#x3002;&#x5728;&#x90A3;&#x4E00;&#x5E74;&#xFF0C;&#x6211;&#x88AB;&#x7092;&#x4E86;&#x9C7F;&#x9C7C;&#x3002;&#x4F60;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#x88AB;&#x4F60;&#x81EA;&#x5DF1;&#x521B;&#x7ACB;&#x7684;&#x516C;&#x53F8;&#x7092;&#x4E86;&#x9C7F;&#x9C7C;&#x5462;&#xFF1F;&#x55EF;&#xFF0C;&#x5728;&#x82F9;&#x679C;&#x5FEB;&#x901F;&#x6210;&#x957F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x96C7;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x5929;&#x5206;&#x7684;&#x5BB6;&#x4F19;&#x548C;&#x6211;&#x4E00;&#x8D77;&#x7BA1;&#x7406;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#xFF0C;&#x5728;&#x6700;&#x521D;&#x7684;&#x51E0;&#x5E74;&#xFF0C;&#x516C;&#x53F8;&#x8FD0;&#x8F6C;&#x7684;&#x5F88;&#x597D;&#x3002;&#x4F46;&#x662F;&#x540E;&#x6765;&#x6211;&#x4EEC;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x770B;&#x6CD5;&#x53D1;&#x751F;&#x4E86;&#x5206;&#x6B67;&#x3002;&#x5F53;&#x4E89;&#x5435;&#x4E0D;&#x53EF;&#x5F00;&#x4EA4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8463;&#x4E8B;&#x4F1A;&#x7AD9;&#x5728;&#x4E86;&#x4ED6;&#x7684;&#x90A3;&#x4E00;&#x8FB9;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x4E09;&#x5341;&#x5C81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x88AB;&#x7092;&#x4E86;&#x3002;&#x5728;&#x800C;&#x7ACB;&#x4E4B;&#x5E74;&#xFF0C;&#x6211;&#x751F;&#x547D;&#x7684;&#x5168;&#x90E8;&#x652F;&#x67F1;&#x79BB;&#x81EA;&#x5DF1;&#x8FDC;&#x53BB;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5728;&#x6700;&#x521D;&#x7684;&#x51E0;&#x4E2A;&#x6708;&#x91CC;&#xFF0C;&#x6211;&#x771F;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x628A;&#x4ECE;&#x524D;&#x7684;&#x521B;&#x4E1A;&#x6FC0;&#x60C5;&#x7ED9;&#x4E22;&#x4E86;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8BA9;&#x4E0E;&#x6211;&#x4E00;&#x540C;&#x521B;&#x4E1A;&#x7684;&#x4EBA;&#x90FD;&#x5F88;&#x6CAE;&#x4E27;&#x3002;&#x4F46;&#x662F;&#x6211;&#x6E10;&#x6E10;&#x53D1;&#x73B0;&#x4E86;&#x66D9;&#x5149;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x559C;&#x7231;&#x6211;&#x4ECE;&#x4E8B;&#x7684;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x53D1;&#x751F;&#x7684;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x4E1D;&#x6BEB;&#x7684;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x8FD9;&#x4E9B;&#x3002;&#x6211;&#x88AB;&#x9A71;&#x9010;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4ECD;&#x7136;&#x949F;&#x7231;&#x5B83;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x51B3;&#x5B9A;&#x4ECE;&#x5934;&#x518D;&#x6765;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6211;&#x5F53;&#x65F6;&#x6CA1;&#x6709;&#x89C9;&#x5BDF;&#xFF0C;&#x4F46;&#x4E8B;&#x540E;&#x8BC1;&#x660E;&#xFF0C;&#x4ECE;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x88AB;&#x7092;&#x662F;&#x6211;&#x8FD9;&#x8F88;&#x5B50;&#x53D1;&#x751F;&#x7684;&#x6700;&#x68D2;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x56E0;&#x4E3A;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x8005;&#x7684;&#x6781;&#x4E50;&#x611F;&#x89C9;&#x88AB;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x521B;&#x4E1A;&#x8005;&#x7684;&#x8F7B;&#x677E;&#x611F;&#x89C9;&#x6240;&#x91CD;&#x65B0;&#x4EE3;&#x66FF;&#xFF1A;&#x5BF9;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x90FD;&#x4E0D;&#x90A3;&#x4E48;&#x7279;&#x522B;&#x770B;&#x91CD;&#x3002;&#x8FD9;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x5982;&#x6B64;&#x81EA;&#x7531;&#xFF0C;&#x8FDB;&#x5165;&#x4E86;&#x6211;&#x751F;&#x547D;&#x4E2D;&#x6700;&#x6709;&#x521B;&#x9020;&#x529B;&#x7684;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E94;&#x5E74;&#x91CC;&#xFF0C;&#x6211;&#x521B;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x53EB;NeXT&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x53EB;Pixar&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x7136;&#x540E;&#x548C;&#x4E00;&#x4E2A;&#x540E;&#x6765;&#x6210;&#x4E3A;&#x6211;&#x59BB;&#x5B50;&#x7684;&#x4F18;&#x96C5;&#x5973;&#x4EBA;&#x76F8;&#x8BC6;&#x3002;Pixar&#x73B0;&#x5728;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x6210;&#x529F;&#x7684;&#x7535;&#x8111;&#x5236;&#x4F5C;&#x5DE5;&#x4F5C;&#x5BA4;&#x3002;&#x5728;&#x540E;&#x6765;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x8FD0;&#x8F6C;&#x4E2D;&#xFF0C;&#x82F9;&#x679C;&#x6536;&#x8D2D;&#x4E86;NeXT&#xFF0C;&#x6211;&#x53C8;&#x56DE;&#x5230;&#x4E86;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x3002;&#x6211;&#x4EEC;&#x5728;NeXT&#x53D1;&#x5C55;&#x7684;&#x6280;&#x672F;&#x5728;&#x82F9;&#x679C;&#x7684;&#x590D;&#x5174;&#x4E4B;&#x4E2D;&#x53D1;&#x6325;&#x4E86;&#x5173;&#x952E;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x6211;&#x8FD8;&#x548C;Laurence&#x4E00;&#x8D77;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x5E78;&#x798F;&#x7684;&#x5BB6;&#x5EAD;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6211;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x80AF;&#x5B9A;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4E0D;&#x88AB;&#x82F9;&#x679C;&#x5F00;&#x9664;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x5176;&#x4E2D;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x826F;&#x836F;&#x7684;&#x5473;&#x9053;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x82E6;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x75C5;&#x4EBA;&#x9700;&#x8981;&#x8FD9;&#x4E2A;&#x836F;&#x3002;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x751F;&#x6D3B;&#x4F1A;&#x62FF;&#x8D77;&#x4E00;&#x5757;&#x7816;&#x5934;&#x5411;&#x4F60;&#x7684;&#x8111;&#x888B;&#x4E0A;&#x731B;&#x62CD;&#x4E00;&#x4E0B;&#x3002;&#x4E0D;&#x8981;&#x5931;&#x53BB;&#x4FE1;&#x5FC3;&#x3002;&#x6211;&#x5F88;&#x6E05;&#x695A;&#x552F;&#x4E00;&#x4F7F;&#x6211;&#x4E00;&#x76F4;&#x8D70;&#x4E0B;&#x53BB;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4EE4;&#x6211;&#x65E0;&#x6BD4;&#x949F;&#x7231;&#x3002;&#x4F60;&#x9700;&#x8981;&#x53BB;&#x627E;&#x5230;&#x4F60;&#x6240;&#x7231;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5BF9;&#x4E8E;&#x5DE5;&#x4F5C;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;&#x4F60;&#x7684;&#x7231;&#x4EBA;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x5C06;&#x4F1A;&#x5360;&#x636E;&#x751F;&#x6D3B;&#x4E2D;&#x5F88;&#x5927;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4F60;&#x53EA;&#x6709;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x6240;&#x505A;&#x7684;&#x662F;&#x4F1F;&#x5927;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x6021;&#x7136;&#x81EA;&#x5F97;&#x3002;&#x5982;&#x679C;&#x4F60;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x627E;&#x5230;&#xFF0C;&#x90A3;&#x4E48;&#x7EE7;&#x7EED;&#x627E;&#x3001;&#x4E0D;&#x8981;&#x505C;&#x4E0B;&#x6765;&#x3001;&#x5168;&#x5FC3;&#x5168;&#x610F;&#x7684;&#x53BB;&#x627E;&#xFF0C;&#x5F53;&#x4F60;&#x627E;&#x5230;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x7684;&#x3002;&#x5C31;&#x50CF;&#x4EFB;&#x4F55;&#x771F;&#x8BDA;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x968F;&#x7740;&#x5C81;&#x6708;&#x7684;&#x6D41;&#x901D;&#x53EA;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x7D27;&#x5BC6;&#x3002;&#x6240;&#x4EE5;&#x7EE7;&#x7EED;&#x627E;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x627E;&#x5230;&#x5B83;&#xFF0C;&#x4E0D;&#x8981;&#x505C;&#x4E0B;&#x6765;&#xFF01;</p>
<p>&#x3000;&#x3000;&#x6211;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x6545;&#x4E8B;&#x662F;&#x5173;&#x4E8E;&#x6B7B;&#x4EA1;&#x7684;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5F53;&#x6211;&#x5341;&#x4E03;&#x5C81;&#x7684;&#x65F6;&#x5019;&#xFF0C; &#x6211;&#x8BFB;&#x5230;&#x4E86;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x201C;&#x5982;&#x679C;&#x4F60;&#x628A;&#x6BCF;&#x4E00;&#x5929;&#x90FD;&#x5F53;&#x4F5C;&#x751F;&#x547D;&#x4E2D;&#x6700;&#x540E;&#x4E00;&#x5929;&#x53BB;&#x751F;&#x6D3B;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x201D;&#x8FD9;&#x53E5;&#x8BDD;&#x7ED9;&#x6211;&#x7559;&#x4E0B;&#x4E86;&#x6DF1;&#x523B;&#x7684;&#x5370;&#x8C61;&#x3002;&#x4ECE;&#x90A3;&#x65F6;&#x5F00;&#x59CB;&#xFF0C;&#x8FC7;&#x4E86;33&#x5E74;&#xFF0C;&#x6211;&#x5728;&#x6BCF;&#x5929;&#x65E9;&#x6668;&#x90FD;&#x4F1A;&#x5BF9;&#x7740;&#x955C;&#x5B50;&#x95EE;&#x81EA;&#x5DF1;&#xFF1A;&#x201C;&#x5982;&#x679C;&#x4ECA;&#x5929;&#x662F;&#x6211;&#x751F;&#x547D;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x5929;&#xFF0C;&#x4F60;&#x4F1A;&#x4E0D;&#x4F1A;&#x5B8C;&#x6210;&#x4F60;&#x4ECA;&#x5929;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5462;&#xFF1F;&#x201D;&#x5F53;&#x7B54;&#x6848;&#x8FDE;&#x7EED;&#x5F88;&#x591A;&#x6B21;&#x88AB;&#x7ED9;&#x4E88;&#x201C;&#x4E0D;&#x662F;&#x201D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x6539;&#x53D8;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x4E86;&#x3002;</p>
<p>&#x3000;&#x3000;&#x201C;&#x8BB0;&#x4F4F;&#x4F60;&#x5373;&#x5C06;&#x6B7B;&#x53BB;&#x201D;&#x662F;&#x6211;&#x4E00;&#x751F;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7BB4;&#x8A00;&#x3002;&#x5B83;&#x5E2E;&#x6211;&#x6307;&#x660E;&#x4E86;&#x751F;&#x547D;&#x4E2D;&#x91CD;&#x8981;&#x7684;&#x9009;&#x62E9;&#x3002;&#x56E0;&#x4E3A;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5305;&#x62EC;&#x6240;&#x6709;&#x7684;&#x8363;&#x8A89;&#x3001;&#x6240;&#x6709;&#x7684;&#x9A84;&#x50B2;&#x3001;&#x6240;&#x6709;&#x5BF9;&#x96BE;&#x582A;&#x548C;&#x5931;&#x8D25;&#x7684;&#x6050;&#x60E7;&#xFF0C;&#x8FD9;&#x4E9B;&#x5728;&#x6B7B;&#x4EA1;&#x9762;&#x524D;&#x90FD;&#x4F1A;&#x6D88;&#x5931;&#x3002;&#x6211;&#x770B;&#x5230;&#x7684;&#x662F;&#x7559;&#x4E0B;&#x7684;&#x771F;&#x6B63;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x3000;&#x3000;&#x4F60;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x601D;&#x8003;&#x4F60;&#x5C06;&#x4F1A;&#x5931;&#x53BB;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x201C;&#x8BB0;&#x4F4F;&#x4F60;&#x5373;&#x5C06;&#x6B7B;&#x53BB;&#x201D;&#x662F;&#x6211;&#x77E5;&#x9053;&#x7684;&#x907F;&#x514D;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x7684;&#x6700;&#x597D;&#x529E;&#x6CD5;&#x3002;&#x4F60;&#x5DF2;&#x7ECF;&#x8D64;&#x8EAB;&#x88F8;&#x4F53;&#x4E86;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x4E0D;&#x53BB;&#x8DDF;&#x968F;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x4E00;&#x8D77;&#x8DF3;&#x52A8;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5927;&#x6982;&#x4E00;&#x5E74;&#x4EE5;&#x524D;&#xFF0C;&#x6211;&#x7684;&#x4E00;&#x6B21;&#x4F53;&#x68C0;&#x7ED3;&#x679C;&#x6E05;&#x695A;&#x7684;&#x663E;&#x793A;&#x5728;&#x6211;&#x7684;&#x80F0;&#x817A;&#x6709;&#x4E00;&#x4E2A;&#x80BF;&#x7624;&#x3002;&#x533B;&#x751F;&#x544A;&#x8BC9;&#x6211;&#x90A3;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x79CD;&#x65E0;&#x6CD5;&#x6CBB;&#x6108;&#x7684;&#x764C;&#x75C7;&#xFF0C;&#x6211;&#x8FD8;&#x6709;&#x4E09;&#x5230;&#x516D;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x6D3B;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x3002;&#x6211;&#x7684;&#x533B;&#x751F;&#x53EB;&#x6211;&#x56DE;&#x5BB6;&#xFF0C;&#x7136;&#x540E;&#x6574;&#x7406;&#x597D;&#x6211;&#x7684;&#x4E00;&#x5207;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x533B;&#x751F;&#x51C6;&#x5907;&#x6B7B;&#x4EA1;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x90A3;&#x610F;&#x5473;&#x7740;&#x4F60;&#x5C06;&#x8981;&#x628A;&#x672A;&#x6765;&#x5341;&#x5E74;&#x5BF9;&#x4F60;&#x5C0F;&#x5B69;&#x8BF4;&#x7684;&#x8BDD;&#x5728;&#x51E0;&#x4E2A;&#x6708;&#x91CC;&#x9762;&#x8BF4;&#x5B8C;&#xFF1B;&#x90A3;&#x610F;&#x5473;&#x7740;&#x628A;&#x6BCF;&#x4EF6;&#x4E8B;&#x60C5;&#x90FD;&#x641E;&#x5B9A;&#xFF0C; &#x8BA9;&#x4F60;&#x7684;&#x5BB6;&#x4EBA;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x8F7B;&#x677E;&#x7684;&#x751F;&#x6D3B;&#xFF1B;&#x90A3;&#x610F;&#x5473;&#x7740;&#x4F60;&#x8981;&#x8BF4;&#x201C;&#x518D;&#x89C1;&#x4E86;&#x201D;&#x3002;</p>
<p>&#x3000;&#x3000;&#x6211;&#x6574;&#x5929;&#x548C;&#x90A3;&#x4E2A;&#x8BCA;&#x65AD;&#x4E66;&#x4E00;&#x8D77;&#x751F;&#x6D3B;&#x3002;&#x540E;&#x6765;&#x6709;&#x4E00;&#x5929;&#x65E9;&#x4E0A;&#x533B;&#x751F;&#x5C06;&#x4E00;&#x4E2A;&#x5185;&#x7AA5;&#x955C;&#x4ECE;&#x6211;&#x7684;&#x5589;&#x5499;&#x4F38;&#x8FDB;&#x53BB;&#xFF0C;&#x901A;&#x8FC7;&#x6211;&#x7684;&#x80C3;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x5165;&#x6211;&#x7684;&#x80A0;&#x5B50;&#xFF0C;&#x7528;&#x4E00;&#x6839;&#x9488;&#x5728;&#x6211;&#x7684;&#x80F0;&#x817A;&#x4E0A;&#x7684;&#x80BF;&#x7624;&#x4E0A;&#x53D6;&#x4E86;&#x51E0;&#x4E2A;&#x7EC6;&#x80DE;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5F88;&#x9547;&#x9759;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x88AB;&#x6CE8;&#x5C04;&#x4E86;&#x9547;&#x5B9A;&#x5242;&#x3002;&#x4F46;&#x662F;&#x6211;&#x7684;&#x59BB;&#x5B50;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x540E;&#x6765;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5F53;&#x533B;&#x751F;&#x5728;&#x663E;&#x5FAE;&#x955C;&#x5730;&#x4E0B;&#x89C2;&#x5BDF;&#x8FD9;&#x4E9B;&#x7EC6;&#x80DE;&#x7684;&#x65F6;&#x5019;&#x4ED6;&#x4EEC;&#x5F00;&#x59CB;&#x5C16;&#x53EB;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x7EC6;&#x80DE;&#x6700;&#x540E;&#x7ADF;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7F55;&#x89C1;&#x7684;&#x3001;&#x53EF;&#x4EE5;&#x7528;&#x624B;&#x672F;&#x6CBB;&#x6108;&#x7684;&#x80F0;&#x817A;&#x764C;&#x7EC6;&#x80DE;&#x3002;&#x6211;&#x505A;&#x4E86;&#x8FD9;&#x4E2A;&#x624B;&#x672F;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x75CA;&#x6108;&#x4E86;&#x3002;</p>
<p>&#x3000;&#x3000;&#x90A3;&#x662F;&#x6211;&#x6700;&#x63A5;&#x8FD1;&#x6B7B;&#x4EA1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8FD8;&#x5E0C;&#x671B;&#x8FD9;&#x4E5F;&#x662F;&#x4EE5;&#x540E;&#x7684;&#x51E0;&#x5341;&#x5E74;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x4E00;&#x6B21;&#x3002;&#x4ECE;&#x6B7B;&#x4EA1;&#x7EBF;&#x4E0A;&#x53C8;&#x6D3B;&#x4E86;&#x8FC7;&#x6765;&#xFF0C;&#x6B7B;&#x4EA1;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x4F46;&#x662F;&#x7EAF;&#x7CB9;&#x662F;&#x77E5;&#x8BC6;&#x4E0A;&#x7684;&#x6982;&#x5FF5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x66F4;&#x80AF;&#x5B9A;&#x4E00;&#x70B9;&#x5730;&#x5BF9;&#x4F60;&#x4EEC;&#x8BF4;&#xFF1A;</p>
<p>&#x3000;&#x3000;&#x6CA1;&#x6709;&#x4EBA;&#x613F;&#x610F;&#x6B7B;&#xFF0C;&#x5373;&#x4F7F;&#x4EBA;&#x4EEC;&#x60F3;&#x4E0A;&#x5929;&#x5802;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E3A;&#x4E86;&#x53BB;&#x90A3;&#x91CC;&#x800C;&#x6B7B;&#x3002;&#x4F46;&#x662F;&#x6B7B;&#x4EA1;&#x662F;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x5171;&#x540C;&#x7684;&#x7EC8;&#x70B9;&#x3002;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x591F;&#x9003;&#x8131;&#x5B83;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x5982;&#x6B64;&#x3002;&#x56E0;&#x4E3A;&#x6B7B;&#x4EA1;&#x5C31;&#x662F;&#x751F;&#x547D;&#x4E2D;&#x6700;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x53D1;&#x660E;&#x3002;&#x5B83;&#x5C06;&#x65E7;&#x7684;&#x6E05;&#x9664;&#x4EE5;&#x4FBF;&#x7ED9;&#x65B0;&#x7684;&#x8BA9;&#x8DEF;&#x3002;&#x4F60;&#x4EEC;&#x73B0;&#x5728;&#x662F;&#x65B0;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x4E0D;&#x4E45;&#x4EE5;&#x540E;&#xFF0C;&#x4F60;&#x4EEC;&#x5C06;&#x4F1A;&#x9010;&#x6E10;&#x7684;&#x53D8;&#x6210;&#x65E7;&#x7684;&#x7136;&#x540E;&#x88AB;&#x6E05;&#x9664;&#x3002;&#x6211;&#x5F88;&#x62B1;&#x6B49;&#x8FD9;&#x5F88;&#x5177;&#x6709;&#x620F;&#x5267;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5341;&#x5206;&#x7684;&#x771F;&#x5B9E;&#x3002;</p>
<p>&#x3000;&#x3000;&#x4F60;&#x4EEC;&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x6709;&#x9650;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x5C06;&#x4ED6;&#x4EEC;&#x6D6A;&#x8D39;&#x5728;&#x91CD;&#x590D;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x4E0A;&#x3002;&#x4E0D;&#x8981;&#x88AB;&#x6559;&#x6761;&#x675F;&#x7F1A;&#xFF0C;&#x90A3;&#x610F;&#x5473;&#x7740;&#x4F60;&#x548C;&#x5176;&#x4ED6;&#x4EBA;&#x601D;&#x8003;&#x7684;&#x7ED3;&#x679C;&#x4E00;&#x8D77;&#x751F;&#x6D3B;&#x3002;&#x4E0D;&#x8981;&#x88AB;&#x5176;&#x4ED6;&#x4EBA;&#x55A7;&#x56A3;&#x7684;&#x89C2;&#x70B9;&#x63A9;&#x76D6;&#x4F60;&#x771F;&#x6B63;&#x7684;&#x5185;&#x5FC3;&#x7684;&#x58F0;&#x97F3;&#x3002;&#x8FD8;&#x6709;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x8981;&#x6709;&#x52C7;&#x6C14;&#x53BB;&#x542C;&#x4ECE;&#x4F60;&#x76F4;&#x89C9;&#x548C;&#x5FC3;&#x7075;&#x7684;&#x6307;&#x793A;&#x2014;&#x2014;&#x5B83;&#x4EEC;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x77E5;&#x9053;&#x4F60;&#x60F3;&#x8981;&#x6210;&#x4E3A;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x6B21;&#x8981;&#x7684;&#x3002;</p>
<p>&#x3000;&#x3000;&#x5F53;&#x6211;&#x5E74;&#x8F7B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E00;&#x672C;&#x53EB;&#x505A;&#x201C;&#x6574;&#x4E2A;&#x5730;&#x7403;&#x7684;&#x76EE;&#x5F55;&#x201D;&#x632F;&#x804B;&#x53D1;&#x8069;&#x7684;&#x6742;&#x5FD7;&#xFF0C;&#x5B83;&#x662F;&#x6211;&#x4EEC;&#x90A3;&#x4E00;&#x4EE3;&#x4EBA;&#x7684;&#x5723;&#x7ECF;&#x4E4B;&#x4E00;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x53EB;Stewart Brand&#x7684;&#x5BB6;&#x4F19;&#x795E;&#x5947;&#x5730;&#x5C06;&#x8FD9;&#x672C;&#x4E66;&#x5E26;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3002;&#x90A3;&#x662F;&#x516D;&#x5341;&#x5E74;&#x4EE3;&#x540E;&#x671F;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x672C;&#x4E66;&#x5168;&#x90E8;&#x662F;&#x7528;&#x6253;&#x5B57;&#x673A;&#xFF0C;&#x3001;&#x526A;&#x5200;&#x8FD8;&#x6709;&#x504F;&#x5149;&#x955C;&#x5236;&#x4F5C;&#x7684;&#x3002;</p>
<p>&#x3000;&#x3000;Stewart&#x548C;&#x4ED6;&#x7684;&#x4F19;&#x4F34;&#x51FA;&#x7248;&#x4E86;&#x51E0;&#x671F;&#x7684;&#x201C;&#x6574;&#x4E2A;&#x5730;&#x7403;&#x7684;&#x76EE;&#x5F55;&#x201D;&#xFF0C;&#x5F53;&#x5B83;&#x5B8C;&#x6210;&#x4E86;&#x81EA;&#x5DF1;&#x4F7F;&#x547D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x505A;&#x51FA;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x671F;&#x7684;&#x76EE;&#x5F55;&#x3002;&#x90A3;&#x662F;&#x5728;&#x4E03;&#x5341;&#x5E74;&#x4EE3;&#x7684;&#x4E2D;&#x671F;&#xFF0C;&#x4F60;&#x4EEC;&#x7684;&#x65F6;&#x4EE3;&#x3002;&#x5728;&#x6700;&#x540E;&#x4E00;&#x671F;&#x7684;&#x5C01;&#x5E95;&#x4E0A;&#x662F;&#x6E05;&#x6668;&#x4E61;&#x6751;&#x516C;&#x8DEF;&#x7684;&#x7167;&#x7247;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5192;&#x9669;&#x7CBE;&#x795E;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x627E;&#x5230;&#x8FD9;&#x6761;&#x8DEF;&#x7684;&#xFF09;&#xFF0C;&#x5728;&#x7167;&#x7247;&#x4E4B;&#x4E0B;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x6BB5;&#x8BDD;&#xFF1A;&#x201C;&#x4FDD;&#x6301;&#x9965;&#x997F;&#xFF0C;&#x4FDD;&#x6301;&#x611A;&#x8822;&#x3002;&#x201D;&#x8FD9;&#x662F;&#x4ED6;&#x4EEC;&#x505C;&#x6B62;&#x4E86;&#x53D1;&#x520A;&#x7684;&#x544A;&#x522B;&#x8BED;&#x3002;&#x201C;&#x4FDD;&#x6301;&#x9965;&#x997F;&#xFF0C;&#x4FDD;&#x6301;&#x611A;&#x8822;&#x3002;&#x201D;&#x6211;&#x603B;&#x662F;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x90A3;&#x6837;&#xFF0C;&#x73B0;&#x5728;&#xFF0C; &#x5728;&#x4F60;&#x4EEC;&#x5373;&#x5C06;&#x6BD5;&#x4E1A;&#xFF0C;&#x5F00;&#x59CB;&#x65B0;&#x7684;&#x65C5;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C; &#x6211;&#x4E5F;&#x5E0C;&#x671B;&#x4F60;&#x4EEC;&#x80FD;&#x505A;&#x5230;&#x8FD9;&#x6837;&#xFF1A;&#x4FDD;&#x6301;&#x9965;&#x997F;&#xFF0C;&#x4FDD;&#x6301;&#x611A;&#x8822;&#x3002;</p>
<p>(&#x53F2;&#x8482;&#x592B;&#x2022;&#x4E54;&#x5E03;&#x65AF;&#x4E3A;&#x82F9;&#x679C;&#x7535;&#x8111;&#x548C;Pixar&#x52A8;&#x753B;&#x516C;&#x53F8;CEO&#xFF0C;&#x672C;&#x6587;&#x7CFB;&#x5176;&#x4E8E;2005&#x5E74;6&#x6708;12&#x65E5;&#x5728;&#x65AF;&#x5766;&#x4F5B;&#x5927;&#x5B66;&#x6240;&#x505A;&#x7684;&#x6F14;&#x8BB2;)</p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2011-10-03T07:47:10.000Z" itemprop="datePublished">2011-10-03</time>

    </span>
    <span class="post-description-item">
        

    <span>
        <i class="tags icon"></i>
    </span>

    
    <span class="ui tiny label">
        <a href="/tags/speech/">speech</a>
    </span>

    

    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/2014/01/09/002.In-App-Purcharse 摘要/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    In-App-Purcharse 摘要
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a class="ui tiny button disabled">下一篇<i class="angle right icon"></i></a>

                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    
                </div>

            </div>
            

        </div>
    </div>
</div>



<!-- css -->
  <style type="text/css">
      .center {
          text-align: center;
      }
      .hidden {
          display: none;
      }
    .donate_bar a.btn_donate{
      display: inline-block;
      width: 82px;
      height: 82px;
      background: url("http://7xsl28.com1.z0.glb.clouddn.com/btn_reward.gif") no-repeat;
      _background: url("http://7xsl28.com1.z0.glb.clouddn.com/btn_reward.gif") no-repeat;
      <!-- http://img.t.sinajs.cn/t5/style/images/apps_PRF/e_media/btn_reward.gif
           因为本 hexo 生成的博客所用的 theme 的 a:hover 带动画效果，
         为了在让打赏按钮显示效果正常 而 添加了以下几行 css，
         嵌入其它博客时不一定要它们。 -->
      -webkit-transition: background 0s;
      -moz-transition: background 0s;
      -o-transition: background 0s;
      -ms-transition: background 0s;
      transition: background 0s;
      <!-- /让打赏按钮的效果显示正常 而 添加的几行 css 到此结束 -->
    }
    .donate_bar a.btn_donate:hover{ background-position: 0px -82px;}
    .donate_bar .donate_txt {
      display: block;
      color: #9d9d9d;
      font: 14px/2 "Microsoft Yahei";
    }
    .bold{ font-weight: bold; }
  </style>
<!-- /css -->
<!-- Donate Module -->
  <div id="donate_module">
  <!-- btn_donate & tips -->
    <div id="donate_board" class="donate_bar center">      
    <br>
    <a id="btn_donate" class="btn_donate" target="_self" href="javascript:;" title="Donate 打赏"></a>
    <span class="donate_txt">
      我知道不会有人打赏，可是万一有人想不开呢？
    </span>    
    </div>
  <!-- /btn_donate & tips -->
  <!-- donate guide -->
    <div id="donate_guide" class="donate_bar center hidden">
    <br>
      <a title="用微信扫一扫哦~" class="fancybox" rel="article0">
        <img src="/images/wechat_small.jpg" title="微信打赏 Joe" height="190px" width="auto"/>
      </a>&nbsp;&nbsp;
      <!-- 暂时不需要支付宝，只用微信支付就好了
      <a href="/images/alipay_small.jpg" title="用支付宝扫一扫即可~" class="fancybox" rel="article0">
        <img src="/images/alipay_small.jpg" title="支付宝打赏 Joe" height="190px" width="auto"/>
      </a>
      -->
      <span class="donate_txt">
        我知道不会有人打赏，可是万一有人想不开呢？
      </span>
    </div>
  <!-- /donate guide -->
<!-- donate script -->
  <script type="text/javascript">
    document.getElementById('btn_donate').onclick = function() {
      $('#donate_board').addClass('hidden');
      $('#donate_guide').removeClass('hidden');
    }
    function donate_on_web(){
      $('#donate').submit();
        }
    var original_window_onload = window.onload;
        window.onload = function () {
            if (original_window_onload) {
                original_window_onload();
            }
            //document.getElementById('donate_board_wdg').className = 'hidden';
    }
  </script>
<!-- /donate script -->
</div>
<!-- /Donate Module -->




<!-- duoshuo start -->
<div class="ds-thread" data-thread-key="2011/10/03/001.Jobs-必须找到你所钟爱的东西/" data-title="Jobs-必须找到你所钟爱的东西 | Joe&#39;s Doc" data-url="http://yoursite.com/2011/10/03/001.Jobs-必须找到你所钟爱的东西/"></div>
<!-- 多说评论框 end -->
<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
<script type="text/javascript">
    var duoshuoQuery = {short_name:"joegithubio"};
    (function() {
        var ds = document.createElement('script');
        ds.type = 'text/javascript';ds.async = true;
        ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
        ds.charset = 'UTF-8';
        (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
</script>
<!-- duoshuo end -->

                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2017 <a href="/">Joe Lee</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a
                href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
